In [84]:
import numpy as np
import pandas as pd
from sqlalchemy import create_engine
import glob
import pyodbc

In [85]:
# Use the glob module to list out the files we need
glob.glob("Resources/*.xls")

['Resources\\gross_margin.xls',
 'Resources\\inventories.xls',
 'Resources\\purchases.xls',
 'Resources\\sales.xls']

In [86]:
# The path to our CSV file
sales_file = "Resources/sales.xls"

In [87]:
# Read the sales data into pandas and remove the header
sales_df = pd.read_excel(sales_file, header=None)
sales_df.head(5)

,0,1,2,3,4,5,6,7,8,9,...,17,18,19,20,21,22,23,24,25,26
0,Table with row headers in column B and NAICS c...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,Estimated Annual Sales of U.S. Retail Firms by...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,[Estimates are shown in millions of dollars an...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,NAICS Code,Kind of business,2016.0,2015.0,2014.0,2013.0,2012.0,2011.0,2010.0,2009.0,...,2001.0,2000.0,1999.0,1998.0,1997.0,1996.0,1995.0,1994.0,1993.0,1992.0
4,NaN,"Retail sales, total ………………………………………...……………………...",4856334.0,4725993.0,4639440.0,4458450.0,4302229.0,4102952.0,3818048.0,3612471.0,...,3062268.0,2983276.0,2803090.0,2581762.0,2468767.0,2361549.0,2217616.0,2105235.0,1937628.0,1811237.0

In [88]:
# Get a list of all of our columns
sales_df.columns

Index([ 0,  1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12, 13, 14, 15, 16, 17,
       18, 19, 20, 21, 22, 23, 24, 25, 26],
      dtype='int64')

In [89]:
# Drop the first three rows containing irrelevant information for this analysis by using the index 
sales_row_dropped = sales_df.drop(sales_df.index[[0,1,2]])
sales_row_dropped = sales_row_dropped.reset_index()
sales_row_dropped = sales_row_dropped.drop(['index'], axis=1)
sales_row_dropped.head(5)

,0,1,2,3,4,5,6,7,8,9,...,17,18,19,20,21,22,23,24,25,26
0,NAICS Code,Kind of business,2016.0,2015.0,2014.0,2013.0,2012.0,2011.0,2010.0,2009.0,...,2001.0,2000.0,1999.0,1998.0,1997.0,1996.0,1995.0,1994.0,1993.0,1992.0
1,NaN,"Retail sales, total ………………………………………...……………………...",4856334.0,4725993.0,4639440.0,4458450.0,4302229.0,4102952.0,3818048.0,3612471.0,...,3062268.0,2983276.0,2803090.0,2581762.0,2468767.0,2361549.0,2217616.0,2105235.0,1937628.0,1811237.0
2,NaN,"Retail sales, total (excl. motor vehicle and p...",3711915.0,3631881.0,3618589.0,3499156.0,3415735.0,3290014.0,3075135.0,2940699.0,...,2246689.0,2187066.0,2038886.0,1893347.0,1814950.0,1734042.0,1637901.0,1564094.0,1464712.0,1392844.0
3,NaN,GAFO1 ………………………………………...…………………………………………………………...,1263474.0,1258154.0,1238694.0,1212493.0,1191843.0,1155666.0,1114374.0,1088197.0,...,882700.0,862739.0,815665.0,757936.0,713387.0,682613.0,650040.0,616347.0,570782.0,533388.0
4,441,Motor vehicle and parts dealers …………………………...,1144419.0,1094112.0,1020851.0,959294.0,886494.0,812938.0,742913.0,671772.0,...,815579.0,796210.0,764204.0,688415.0,653817.0,627507.0,579715.0,541141.0,472916.0,418393.0

In [90]:
new_header = sales_row_dropped.iloc[0]                    #grab the first row for the header
new_header

0           NAICS Code
1     Kind of business
2               2016.0
3               2015.0
4               2014.0
5               2013.0
6               2012.0
7               2011.0
8               2010.0
9               2009.0
10              2008.0
11              2007.0
12              2006.0
13              2005.0
14              2004.0
15              2003.0
16              2002.0
17              2001.0
18              2000.0
19              1999.0
20              1998.0
21              1997.0
22              1996.0
23              1995.0
24              1994.0
25              1993.0
26              1992.0
Name: 0, dtype: object

In [91]:
sales_new_df = sales_row_dropped[1:]                      #take the data except the header row because index 0 is taken as header
sales_new_df

,0,1,2,3,4,5,6,7,8,9,...,17,18,19,20,21,22,23,24,25,26
1,NaN,"Retail sales, total ………………………………………...……………………...",4856334.0,4725993.0,4639440.0,4458450.0,4302229.0,4102952.0,3818048.0,3612471.0,...,3062268.0,2983276.0,2803090.0,2581762.0,2468767.0,2361549.0,2217616.0,2105235.0,1937628.0,1811237.0
2,NaN,"Retail sales, total (excl. motor vehicle and p...",3711915.0,3631881.0,3618589.0,3499156.0,3415735.0,3290014.0,3075135.0,2940699.0,...,2246689.0,2187066.0,2038886.0,1893347.0,1814950.0,1734042.0,1637901.0,1564094.0,1464712.0,1392844.0
3,NaN,GAFO1 ………………………………………...…………………………………………………………...,1263474.0,1258154.0,1238694.0,1212493.0,1191843.0,1155666.0,1114374.0,1088197.0,...,882700.0,862739.0,815665.0,757936.0,713387.0,682613.0,650040.0,616347.0,570782.0,533388.0
4,441,Motor vehicle and parts dealers …………………………...,1144419.0,1094112.0,1020851.0,959294.0,886494.0,812938.0,742913.0,671772.0,...,815579.0,796210.0,764204.0,688415.0,653817.0,627507.0,579715.0,541141.0,472916.0,418393.0
5,4411,Automobile dealers ………………………………………...………………...,984433.0,940450.0,875566.0,819290.0,752778.0,684505.0,621180.0,551996.0,...,707676.0,687782.0,661820.0,593501.0,564658.0,543949.0,501684.0,468100.0,407126.0,358444.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
72,Footnotes:,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
73,1GAFO represents stores classified in the foll...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
74,rRevised data,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
75,Note: Estimated measures of sample variability...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
76,Note: Retail total and other subsector totals ...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [92]:
sales_new_df.columns = new_header                               #set the header row as the df header
sales_new_df                                                    # now file contains header

,NAICS Code,Kind of business,2016.0,2015.0,2014.0,2013.0,2012.0,2011.0,2010.0,2009.0,...,2001.0,2000.0,1999.0,1998.0,1997.0,1996.0,1995.0,1994.0,1993.0,1992.0
1,NaN,"Retail sales, total ………………………………………...……………………...",4856334.0,4725993.0,4639440.0,4458450.0,4302229.0,4102952.0,3818048.0,3612471.0,...,3062268.0,2983276.0,2803090.0,2581762.0,2468767.0,2361549.0,2217616.0,2105235.0,1937628.0,1811237.0
2,NaN,"Retail sales, total (excl. motor vehicle and p...",3711915.0,3631881.0,3618589.0,3499156.0,3415735.0,3290014.0,3075135.0,2940699.0,...,2246689.0,2187066.0,2038886.0,1893347.0,1814950.0,1734042.0,1637901.0,1564094.0,1464712.0,1392844.0
3,NaN,GAFO1 ………………………………………...…………………………………………………………...,1263474.0,1258154.0,1238694.0,1212493.0,1191843.0,1155666.0,1114374.0,1088197.0,...,882700.0,862739.0,815665.0,757936.0,713387.0,682613.0,650040.0,616347.0,570782.0,533388.0
4,441,Motor vehicle and parts dealers …………………………...,1144419.0,1094112.0,1020851.0,959294.0,886494.0,812938.0,742913.0,671772.0,...,815579.0,796210.0,764204.0,688415.0,653817.0,627507.0,579715.0,541141.0,472916.0,418393.0
5,4411,Automobile dealers ………………………………………...………………...,984433.0,940450.0,875566.0,819290.0,752778.0,684505.0,621180.0,551996.0,...,707676.0,687782.0,661820.0,593501.0,564658.0,543949.0,501684.0,468100.0,407126.0,358444.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
72,Footnotes:,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
73,1GAFO represents stores classified in the foll...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
74,rRevised data,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
75,Note: Estimated measures of sample variability...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
76,Note: Retail total and other subsector totals ...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [93]:
# Stack the dataframe in order to have year in columns and set index to NAICS Code and Kind of Business

sales_stack_df = sales_new_df.set_index(['NAICS Code','Kind of business']).stack()  
# The stack() method reshapes the DataFrame into a table with a new inner-most level of rows for each column.

In [94]:
# Create a new dataframe with series
sales_stack_new_df = pd.DataFrame(sales_stack_df)
# The stack() method reshapes the DataFrame into a table with a new inner-most level of rows for each column.

In [95]:
sales_stack_new_df

                                                                              0
NAICS Code Kind of business                                   0
NaN        Retail sales, total ………………………………………...………………………... 2016.0  4856334.0
                                                              2015.0  4725993.0
                                                              2014.0  4639440.0
                                                              2013.0  4458450.0
                                                              2012.0  4302229.0
...                                                                         ...
45431      Fuel dealers ………………………………………...…………………………………………... 1996.0    22563.0
                                                              1995.0    19820.0
                                                              1994.0    18700.0
                                                              1993.0    17566.0
                                                              1992.0    16665.0

[1775 rows x 1 columns]

In [96]:
# Rename index columns
sales_stack_new_df.index.names = ['NAICS Code', 'Kind of Business', 'Year']

In [97]:
# Reset the index
df_new_sales = sales_stack_new_df.reset_index()

In [98]:
df_new_sales

,NAICS Code,Kind of Business,Year,0
0,NaN,"Retail sales, total ………………………………………...……………………...",2016.0,4856334.0
1,NaN,"Retail sales, total ………………………………………...……………………...",2015.0,4725993.0
2,NaN,"Retail sales, total ………………………………………...……………………...",2014.0,4639440.0
3,NaN,"Retail sales, total ………………………………………...……………………...",2013.0,4458450.0
4,NaN,"Retail sales, total ………………………………………...……………………...",2012.0,4302229.0
...,...,...,...,...
1770,45431,Fuel dealers ………………………………………...………………………………………...,1996.0,22563.0
1771,45431,Fuel dealers ………………………………………...………………………………………...,1995.0,19820.0
1772,45431,Fuel dealers ………………………………………...………………………………………...,1994.0,18700.0
1773,45431,Fuel dealers ………………………………………...………………………………………...,1993.0,17566.0
1774,45431,Fuel dealers ………………………………………...………………………………………...,1992.0,16665.0

In [99]:
df_new_sales.rename(columns={0:'Retail Sales Amount'}, inplace=True)             #U are replacing colum with Retail Sales Amount

In [100]:
df_new_sales

,NAICS Code,Kind of Business,Year,Retail Sales Amount
0,NaN,"Retail sales, total ………………………………………...……………………...",2016.0,4856334.0
1,NaN,"Retail sales, total ………………………………………...……………………...",2015.0,4725993.0
2,NaN,"Retail sales, total ………………………………………...……………………...",2014.0,4639440.0
3,NaN,"Retail sales, total ………………………………………...……………………...",2013.0,4458450.0
4,NaN,"Retail sales, total ………………………………………...……………………...",2012.0,4302229.0
...,...,...,...,...
1770,45431,Fuel dealers ………………………………………...………………………………………...,1996.0,22563.0
1771,45431,Fuel dealers ………………………………………...………………………………………...,1995.0,19820.0
1772,45431,Fuel dealers ………………………………………...………………………………………...,1994.0,18700.0
1773,45431,Fuel dealers ………………………………………...………………………………………...,1993.0,17566.0
1774,45431,Fuel dealers ………………………………………...………………………………………...,1992.0,16665.0

In [101]:
df_new_sales.isna()                               #Checks whether Dataframe or a Series contain missing or null values (NA, NaN)

      NAICS Code  Kind of Business   Year  Retail Sales Amount
0           True             False  False                False
1           True             False  False                False
2           True             False  False                False
3           True             False  False                False
4           True             False  False                False
...          ...               ...    ...                  ...
1770       False             False  False                False
1771       False             False  False                False
1772       False             False  False                False
1773       False             False  False                False
1774       False             False  False                False

[1775 rows x 4 columns]

In [102]:
# Drop NAN
df_new_sales = df_new_sales.dropna()

In [103]:
df_new_sales.dtypes

NAICS Code              object
Kind of Business        object
Year                   float64
Retail Sales Amount    float64
dtype: object

In [104]:
df_new_sales.head()                                               # 75 rows are now removed from the Data Frame

,NAICS Code,Kind of Business,Year,Retail Sales Amount
75,441,Motor vehicle and parts dealers …………………………...,2016.0,1144419.0
76,441,Motor vehicle and parts dealers …………………………...,2015.0,1094112.0
77,441,Motor vehicle and parts dealers …………………………...,2014.0,1020851.0
78,441,Motor vehicle and parts dealers …………………………...,2013.0,959294.0
79,441,Motor vehicle and parts dealers …………………………...,2012.0,886494.0

In [105]:
print(df_new_sales['Year'].unique())                 #build-up line because I was getting too much error in next cell

[2016. 2015. 2014. 2013. 2012. 2011. 2010. 2009. 2008. 2007. 2006. 2005.
 2004. 2003. 2002. 2001. 2000. 1999. 1998. 1997. 1996. 1995. 1994. 1993.
 1992.]

In [106]:
# Format the year to datetime and remove the decimal
# Assuming 'Year' is the column name
df_new_sales['Year'] = pd.to_datetime(df_new_sales['Year'], format='%Y', errors='coerce').dt.year

# https://stackoverflow.com/questions/25015711/time-data-does-not-match-format
# https://docs.python.org/3/library/datetime.html#strftime-and-strptime-format-codes
#https://docs.python.org/3/library/datetime.html#strftime-strptime-behavior

# Format Kind of Business and Retail Sales Amount columns
#df_new_sales['Retail Sales Amount'] = df_new_sales['Retail Sales Amount']._is_view
df_new_sales['Retail Sales Amount'] = df_new_sales['Retail Sales Amount'].astype(np.int64)
df_new_sales['Kind of Business'] = df_new_sales['Kind of Business'].astype(str)

C:\Users\MAYANK\AppData\Local\Temp\ipykernel_11004\530464943.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_new_sales['Year'] = pd.to_datetime(df_new_sales['Year'], format='%Y', errors='coerce').dt.year
C:\Users\MAYANK\AppData\Local\Temp\ipykernel_11004\530464943.py:11: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_new_sales['Retail Sales Amount'] = df_new_sales['Retail Sales Amount'].astype(np.int64)
C:\Users\MAYANK\AppData\Local\Temp\ipykernel_11004\530464943.py:12: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_new_sales['Kind of Business'] = df_new_sales['Kind of Business'].astype(str)

In [107]:
df_new_sales.dtypes

NAICS Code             object
Kind of Business       object
Year                    int32
Retail Sales Amount     int64
dtype: object

In [108]:
df_new_sales.head()

,NAICS Code,Kind of Business,Year,Retail Sales Amount
75,441,Motor vehicle and parts dealers …………………………...,2016,1144419
76,441,Motor vehicle and parts dealers …………………………...,2015,1094112
77,441,Motor vehicle and parts dealers …………………………...,2014,1020851
78,441,Motor vehicle and parts dealers …………………………...,2013,959294
79,441,Motor vehicle and parts dealers …………………………...,2012,886494

In [109]:
# Create new data-set with selected columns
sales_transformed = df_new_sales[['Year', 'Kind of Business', 'Retail Sales Amount']].copy()
sales_transformed.head(5)

,Year,Kind of Business,Retail Sales Amount
75,2016,Motor vehicle and parts dealers …………………………...,1144419
76,2015,Motor vehicle and parts dealers …………………………...,1094112
77,2014,Motor vehicle and parts dealers …………………………...,1020851
78,2013,Motor vehicle and parts dealers …………………………...,959294
79,2012,Motor vehicle and parts dealers …………………………...,886494

In [110]:
sales_transformed.dtypes

Year                    int32
Kind of Business       object
Retail Sales Amount     int64
dtype: object

In [111]:
# Reset index after dropping NAN and reformatting Year and Retail Sales Amount data type
sales_transformed = sales_transformed.reset_index(drop=True)

In [112]:
sales_transformed.head()

,Year,Kind of Business,Retail Sales Amount
0,2016,Motor vehicle and parts dealers …………………………...,1144419
1,2015,Motor vehicle and parts dealers …………………………...,1094112
2,2014,Motor vehicle and parts dealers …………………………...,1020851
3,2013,Motor vehicle and parts dealers …………………………...,959294
4,2012,Motor vehicle and parts dealers …………………………...,886494

In [113]:
# Pivot the table to set Year as index
sales_transformed = pd.pivot_table(sales_transformed, index=['Year'], values=['Retail Sales Amount'])
sales_transformed['Retail Sales Amount'] = sales_transformed['Retail Sales Amount'].astype(int)
sales_transformed.head(5)

      Retail Sales Amount
Year
1992                72982
1993                78244
1994                85105
1995                89635
1996                95153

In [114]:
sales_transformed.rename(columns={'Retail Sales Amount':'Retail_Sales_Amount'}, inplace=True)      
#reshaping our column like database columns

In [115]:
# Function to loop through the resources folder and create dataframe for other excel files 

all_df = []
for f in glob.glob("Resources/*.xls"):
    df = pd.read_excel(f, header= None)
    df_row_dropped = df.drop(df.index[[0,1,2]])
    df_row_dropped = df_row_dropped.reset_index()
    df_row_dropped = df_row_dropped.drop(['index'], axis=1)
    new_header = df_row_dropped.iloc[0]
    df_new = df_row_dropped[1:]
    df_new.columns = new_header
    df_new = df_new.set_index(['NAICS Code','Kind of business']).stack()
    df_new = pd.DataFrame(df_new)
    df_new.index.names = ['NAICS Code', 'Kind of Business', 'Year']
    df_final = df_new.reset_index()
    df_final.rename(columns={0: f}, inplace=True)
    df_final = df_final.dropna()
    df_final['Year'] = pd.to_datetime(df_final['Year'], format='%Y', errors='coerce').dt.year
    df_final[f] = df_final[f].astype(int)
    df_transformed = df_final[['Year', 'Kind of Business', f]].copy()
    df_transformed = df_transformed.reset_index(drop=True)
    df_transformed = pd.pivot_table(df_transformed, index=['Year'], values=[f])
    df_transformed[f] = df_transformed[f].astype(int)

    all_df.append(df_transformed)
    print(f)

Resources\gross_margin.xls
Resources\inventories.xls
Resources\purchases.xls
Resources\sales.xls

In [116]:
# rename the dataframe by accessing to the list by index
gm_df = all_df[0]
inventories_df = all_df[1]
purchases_df = all_df[2]

In [117]:
gm_df.head(2)

      Resources\gross_margin.xls
Year
1993                       33690
1994                       36282

In [118]:
# Rename columns and format data types
gm_df.rename(columns={'Resources\gross_margin.xls':'Gross_Margin_Amount'}, inplace=True)
inventories_df.rename(columns={'Resources\inventories.xls':'Inventories_Amount'}, inplace=True)
purchases_df.rename(columns={'Resources\purchases.xls':'Purchases_Amount'}, inplace=True)

In [119]:
# Create database connection 
connection_string = "root:Password@2024#@localhost/mayank_db1"
engine = create_engine(f'mysql+mysqlconnector://root:Password2024#@localhost/mayank_db1')

#https://stackoverflow.com/questions/38332787/pandas-to-sql-to-sqlite-returns-engine-object-has-no-attribute-cursor

In [120]:
sales_transformed.head()

      Retail_Sales_Amount
Year
1992                72982
1993                78244
1994                85105
1995                89635
1996                95153

In [129]:
# Load DataFrames into database

# Load your DataFrame (df) into a database table using to_sql()
sales_transformed.to_sql(name='sales', con=engine, if_exists='replace', index=True)

25

In [130]:
purchases_df.to_sql(name='purchases', con=engine, if_exists='replace', index=True)

25

In [131]:
inventories_df.to_sql(name='inventories', con=engine, if_exists='replace', index=True)

25

In [132]:
gm_df.to_sql(name='grossmargin', con=engine, if_exists='replace', index=True)

24

In [ ]:
inventories_df.head()

In [124]:
# Confirm data has been added by quering the sales
pd.read_sql_query('select * from sales', con=engine).head()

   year  retail_sales_amount
0  1992                72982
1  1993                78244
2  1994                85105
3  1995                89635
4  1996                95153